Masmiseim36/nxpSDK/devices/MKV11Z7/MKV11Z7.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>DMAMUX</name>
      <description>DMA channel multiplexor</description>
      <prependToName>DMAMUX_</prependToName>
      <baseAddress>0x40021000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x8</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <dim>8</dim>
          <dimIncrement>0x1</dimIncrement>
          <dimIndex>0,1,2,3,4,5,6,7</dimIndex>
          <name>CHCFG%s</name>
          <description>Channel Configuration register</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFF</resetMask>
          <fields>
            <field>
              <name>SOURCE</name>
              <description>DMA Channel Source (Slot)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>Disable</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>UART0_Receive_Complete</description>
                  <value>#10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3</name>
                  <description>UART0_Transmit_Complete</description>
                  <value>#11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>UART1_Receive_Complete</description>
                  <value>#100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5</name>
                  <description>UART1_Transmit_Complete</description>
                  <value>#101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14</name>
                  <description>CAN0Rx</description>
                  <value>#1110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>SPI0_Receive_Complete</description>
                  <value>#10000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>17</name>
                  <description>SPI0_Transmit_Complete</description>
                  <value>#10001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>22</name>
                  <description>I2C0_Transmission_Complete</description>
                  <value>#10110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>FTM0_CH0_Event</description>
                  <value>#11000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>25</name>
                  <description>FTM0_CH1_Event</description>
                  <value>#11001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>26</name>
                  <description>FTM0_CH2_Event</description>
                  <value>#11010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>27</name>
                  <description>FTM0_CH3_Event</description>
                  <value>#11011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>28</name>
                  <description>FTM0_CH4_Event</description>
                  <value>#11100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>29</name>
                  <description>FTM0_CH5_Event</description>
                  <value>#11101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>30</name>
                  <description>FTM4_CH0_Event</description>
                  <value>#11110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>31</name>
                  <description>FTM4_CH1_Event</description>
                  <value>#11111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>FTM1_CH0_Event</description>
                  <value>#100000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>33</name>
                  <description>FTM1_CH1_Event</description>
                  <value>#100001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>34</name>
                  <description>FTM2_CH0_Event</description>
                  <value>#100010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>35</name>
                  <description>FTM2_CH1_Event</description>
                  <value>#100011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>36</name>
                  <description>FTM3_CH0_Event</description>
                  <value>#100100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>37</name>
                  <description>FTM3_CH1_Event</description>
                  <value>#100101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>38</name>
                  <description>FTM3_CH2_Event</description>
                  <value>#100110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>39</name>
                  <description>FTM3_CH3_Event</description>
                  <value>#100111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>40</name>
                  <description>ADC0_COCO</description>
                  <value>#101000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>41</name>
                  <description>ADC1_COCO</description>
                  <value>#101001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>42</name>
                  <description>CMP0_Output</description>
                  <value>#101010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>43</name>
                  <description>CMP1_Output</description>
                  <value>#101011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>45</name>
                  <description>DAC0_Buffer_Limit</description>
                  <value>#101101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>47</name>
                  <description>PDB1_Programmable_Interrupt</description>
                  <value>#101111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>48</name>
                  <description>PDB0_Programmable_Interrupt</description>
                  <value>#110000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>49</name>
                  <description>PORTA_Rising_Falling_Edge</description>
                  <value>#110001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>50</name>
                  <description>PORTB_Rising_Falling_Edge</description>
                  <value>#110010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>51</name>
                  <description>PORTC_Rising_Falling_Edge</description>
                  <value>#110011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>52</name>
                  <description>PORTD_Rising_Falling_Edge</description>
                  <value>#110100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>53</name>
                  <description>PORTE_Rising_Falling_Edge</description>
                  <value>#110101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>54</name>
                  <description>FTM3_CH4_Event</description>
                  <value>#110110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>55</name>
                  <description>FTM3_CH5_Event</description>
                  <value>#110111</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>56</name>
                  <description>FTM5_CH0_Event</description>
                  <value>#111000</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>57</name>
                  <description>FTM5_CH1_Event</description>
                  <value>#111001</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>58</name>
                  <description>DMAMUX_Always_Enabled58</description>
                  <value>#111010</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>59</name>
                  <description>DMAMUX_Always_Enabled59</description>
                  <value>#111011</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>60</name>
                  <description>DMAMUX_Always_Enabled60</description>
                  <value>#111100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>61</name>
                  <description>DMAMUX_Always_Enabled61</description>
                  <value>#111101</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>62</name>
                  <description>DMAMUX_Always_Enabled62</description>
                  <value>#111110</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>63</name>
                  <description>DMAMUX_Always_Enabled63</description>
                  <value>#111111</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENBL</name>
              <description>DMA Channel Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>DMA channel is disabled. This mode is primarily used during configuration of the DMAMux. The DMA has separate channel enables/disables, which should be used to disable or reconfigure a DMA channel.</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>DMA channel is enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
