Masmiseim36/nxpSDK/devices/MKV11Z7/MKV11Z7.xml
                  <description>write: disable digital-to-analog converter 0 interrupt; read: digital-to-analog converter 0 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA26</name>
              <description>FlexTimer module 5 fault, overflow and channels interrupt clear-enable bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 5 fault, overflow and channels interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable FlexTimer module 5 fault, overflow and channels interrupt; read: FlexTimer module 5 fault, overflow and channels interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA27</name>
              <description>multipurpose clock generator interrupt clear-enable bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: multipurpose clock generator interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable multipurpose clock generator interrupt; read: multipurpose clock generator interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA28</name>
              <description>Low-Power Timer interrupt clear-enable bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low-Power Timer interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable Low-Power Timer interrupt; read: Low-Power Timer interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA29</name>
              <description>single interrupt vector for programmable delay block 0 and 1 interrupt clear-enable bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: single interrupt vector for programmable delay block 0 and 1 interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable single interrupt vector for programmable delay block 0 and 1 interrupt; read: single interrupt vector for programmable delay block 0 and 1 interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA30</name>
              <description>PORTA pin detect interrupt clear-enable bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTA pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable PORTA pin detect interrupt; read: PORTA pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLRENA31</name>
              <description>PORTB, PORTC, PORTD and PORTE pin detect interrupt clear-enable bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTB, PORTC, PORTD and PORTE pin detect interrupt disabled</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: disable PORTB, PORTC, PORTD and PORTE pin detect interrupt; read: PORTB, PORTC, PORTD and PORTE pin detect interrupt enabled</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>NVIC_ISPR</name>
          <description>Interrupt Set Pending Register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SETPEND0</name>
              <description>DMA channel 0 and 4 transfer complete interrupt set-pending bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA channel 0 and 4 transfer complete interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the DMA channel 0 and 4 transfer complete interrupt state to pending; read: DMA channel 0 and 4 transfer complete interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND1</name>
              <description>DMA channel 1 and 5 transfer complete interrupt set-pending bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA channel 1 and 5 transfer complete interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the DMA channel 1 and 5 transfer complete interrupt state to pending; read: DMA channel 1 and 5 transfer complete interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND2</name>
              <description>DMA channel 2 and 6 transfer complete interrupt set-pending bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA channel 2 and 6 transfer complete interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the DMA channel 2 and 6 transfer complete interrupt state to pending; read: DMA channel 2 and 6 transfer complete interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND3</name>
              <description>DMA channel 2 and 7 transfer complete interrupt set-pending bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA channel 2 and 7 transfer complete interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the DMA channel 2 and 7 transfer complete interrupt state to pending; read: DMA channel 2 and 7 transfer complete interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND4</name>
              <description>DMA error interrupt channels 0-7 interrupt set-pending bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: DMA error interrupt channels 0-7 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the DMA error interrupt channels 0-7 interrupt state to pending; read: DMA error interrupt channels 0-7 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND5</name>
              <description>FTFA command complete and read collision interrupt set-pending bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FTFA command complete and read collision interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FTFA command complete and read collision interrupt state to pending; read: FTFA command complete and read collision interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND6</name>
              <description>low-voltage detect and low-voltage warning interrupt set-pending bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: low-voltage detect and low-voltage warning interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the low-voltage detect and low-voltage warning interrupt state to pending; read: low-voltage detect and low-voltage warning interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND7</name>
              <description>low leakage wakeup interrupt set-pending bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: low leakage wakeup interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the low leakage wakeup interrupt state to pending; read: low leakage wakeup interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND8</name>
              <description>inter-integrated circuit 0 interrupt set-pending bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: inter-integrated circuit 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the inter-integrated circuit 0 interrupt state to pending; read: inter-integrated circuit 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND9</name>
              <description>Reserved iv 25 interrupt set-pending bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Reserved iv 25 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Reserved iv 25 interrupt state to pending; read: Reserved iv 25 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND10</name>
              <description>serial peripheral interface 0 interrupt set-pending bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: serial peripheral interface 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the serial peripheral interface 0 interrupt state to pending; read: serial peripheral interface 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND11</name>
              <description>Reserved iv 27 interrupt set-pending bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Reserved iv 27 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Reserved iv 27 interrupt state to pending; read: Reserved iv 27 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND12</name>
              <description>UART0 status and error interrupt set-pending bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: UART0 status and error interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the UART0 status and error interrupt state to pending; read: UART0 status and error interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND13</name>
              <description>UART1 status and error interrupt set-pending bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: UART1 status and error interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the UART1 status and error interrupt state to pending; read: UART1 status and error interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND14</name>
              <description>flexray controller area network interrupt set-pending bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: flexray controller area network interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the flexray controller area network interrupt state to pending; read: flexray controller area network interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND15</name>
              <description>Analog-to-digital converter 0 interrupt set-pending bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Analog-to-digital converter 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Analog-to-digital converter 0 interrupt state to pending; read: Analog-to-digital converter 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND16</name>
              <description>Analog-to-digital converter 1 interrupt set-pending bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Analog-to-digital converter 1 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Analog-to-digital converter 1 interrupt state to pending; read: Analog-to-digital converter 1 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND17</name>
              <description>FlexTimer module 0 fault, overflow and channels interrupt set-pending bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 0 fault, overflow and channels interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FlexTimer module 0 fault, overflow and channels interrupt state to pending; read: FlexTimer module 0 fault, overflow and channels interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND18</name>
              <description>FlexTimer module 1 fault, overflow and channels interrupt set-pending bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 1 fault, overflow and channels interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
