Masmiseim36/nxpSDK/devices/MKV11Z7/MKV11Z7.xml
                  <description>write: changes the FlexTimer module 1 fault, overflow and channels interrupt state to pending; read: FlexTimer module 1 fault, overflow and channels interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND19</name>
              <description>FlexTimer module 2 fault, overflow and channels interrupt set-pending bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 2 fault, overflow and channels interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FlexTimer module 2 fault, overflow and channels interrupt state to pending; read: FlexTimer module 2 fault, overflow and channels interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND20</name>
              <description>Comparator 0 interrupt set-pending bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Comparator 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Comparator 0 interrupt state to pending; read: Comparator 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND21</name>
              <description>Comparator 1 interrupt set-pending bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Comparator 1 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Comparator 1 interrupt state to pending; read: Comparator 1 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND22</name>
              <description>FlexTimer module 3 fault, overflow and channels interrupt set-pending bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 3 fault, overflow and channels interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FlexTimer module 3 fault, overflow and channels interrupt state to pending; read: FlexTimer module 3 fault, overflow and channels interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND23</name>
              <description>single interrupt vector for WDOG and EWM interrupt set-pending bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: single interrupt vector for WDOG and EWM interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the single interrupt vector for WDOG and EWM interrupt state to pending; read: single interrupt vector for WDOG and EWM interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND24</name>
              <description>FlexTimer module 4 fault, overflow and channels interrupt set-pending bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 4 fault, overflow and channels interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FlexTimer module 4 fault, overflow and channels interrupt state to pending; read: FlexTimer module 4 fault, overflow and channels interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND25</name>
              <description>digital-to-analog converter 0 interrupt set-pending bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: digital-to-analog converter 0 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the digital-to-analog converter 0 interrupt state to pending; read: digital-to-analog converter 0 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND26</name>
              <description>FlexTimer module 5 fault, overflow and channels interrupt set-pending bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: FlexTimer module 5 fault, overflow and channels interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the FlexTimer module 5 fault, overflow and channels interrupt state to pending; read: FlexTimer module 5 fault, overflow and channels interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND27</name>
              <description>multipurpose clock generator interrupt set-pending bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: multipurpose clock generator interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the multipurpose clock generator interrupt state to pending; read: multipurpose clock generator interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND28</name>
              <description>Low-Power Timer interrupt set-pending bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: Low-Power Timer interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the Low-Power Timer interrupt state to pending; read: Low-Power Timer interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND29</name>
              <description>single interrupt vector for programmable delay block 0 and 1 interrupt set-pending bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: single interrupt vector for programmable delay block 0 and 1 interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the single interrupt vector for programmable delay block 0 and 1 interrupt state to pending; read: single interrupt vector for programmable delay block 0 and 1 interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND30</name>
              <description>PORTA pin detect interrupt set-pending bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTA pin detect interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the PORTA pin detect interrupt state to pending; read: PORTA pin detect interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SETPEND31</name>
              <description>PORTB, PORTC, PORTD and PORTE pin detect interrupt set-pending bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0</name>
                  <description>write: no effect; read: PORTB, PORTC, PORTD and PORTE pin detect interrupt is not pending</description>
                  <value>#0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1</name>
                  <description>write: changes the PORTB, PORTC, PORTD and PORTE pin detect interrupt state to pending; read: PORTB, PORTC, PORTD and PORTE pin detect interrupt is pending</description>
                  <value>#1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
